#include "Bot/Bot.h"
#include "State/State.h"
#include "States/MainMenu/MainMenuState.h"

const std::string token = "7262333796:AAFwzFBdKZ7btr60P0TXt29uMWR4I4gA3Kk";
std::string connectionString = "host=localhost port=5432 dbname=seller_bot user=postgres password=admin connect_timeout=10";

int main() {
    setlocale(LC_ALL, "Russian");
    SetConsoleWidth(130);  // Установить ширину консоли в 120 символов
    std::cout << R"(
      ___           ___           ___       ___       ___           ___                    ___           ___                   
     /  /\         /  /\         /  /\     /  /\     /  /\         /  /\                  /  /\         /  /\          ___     
    /  /::\       /  /::\       /  /:/    /  /:/    /  /::\       /  /::\                /  /::\       /  /::\        /__/\    
   /__/:/\:\     /  /:/\:\     /  /:/    /  /:/    /  /:/\:\     /  /:/\:\              /  /:/\:\     /  /:/\:\       \  \:\   
  _\_ \:\ \:\   /  /::\ \:\   /  /:/    /  /:/    /  /::\ \:\   /  /::\ \:\            /  /::\ \:\   /  /:/  \:\       \__\:\  
 /__/\ \:\ \:\ /__/:/\:\ \:\ /__/:/    /__/:/    /__/:/\:\ \:\ /__/:/\:\_\:\          /__/:/\:\_\:| /__/:/ \__\:\      /  /::\ 
 \  \:\ \:\_\/ \  \:\ \:\_\/ \  \:\    \  \:\    \  \:\ \:\_\/ \__\/~|::\/:/          \  \:\ \:\/:/ \  \:\ /  /:/     /  /:/\:\
  \  \:\_\:\    \  \:\ \:\    \  \:\    \  \:\    \  \:\ \:\      |  |:|::/            \  \:\_\::/   \  \:\  /:/     /  /:/__\/
   \  \:\/:/     \  \:\_\/     \  \:\    \  \:\    \  \:\_\/      |  |:|\/              \  \:\/:/     \  \:\/:/     /__/:/     
    \  \::/       \  \:\        \  \:\    \  \:\    \  \:\        |__|:|~                \__\::/       \  \::/      \__\/      
     \__\/         \__\/         \__\/     \__\/     \__\/         \__\|                     ~~         \__\/                  
    )" << std::endl;


    Bot bot(token, connectionString);
    bot.run();
    return 0;
}

// -1 от колва твоара при заказе